Tekla Open API Reference for Tekla Structures 2025
LocExtension Class
 Localization binding for strings referred in xaml
Inheritance Hierarchy
System.Object
 System.Windows.Markup.MarkupExtension
 System.Windows.Data.BindingBase
 System.Windows.Data.Binding
 Tekla.Structures.Dialog.LocExtension
 Namespace: Tekla.Structures.Dialog
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public class LocExtension : Binding
Public Class LocExtension
	Inherits Binding
The LocExtension type exposes the following members.
Constructors
Name | Description
LocExtension
 Localization extension for strings referred in xaml
Top
See Also
Reference
Tekla.Structures.Dialog Namespace